In [7]:
#concat of 2 series into a single series
import pandas as pd
sr1=pd.Series([1,2,3,4,5])
sr2=pd.Series([6,7,8,9,10])
pd.concat([sr1,sr2] , ignore_index=True)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [8]:
#conacting 2 dataframes
var=pd.DataFrame({'name': ['John', 'Alice', 'Bob'], 'age': [25, 12,14]})
var2 = pd.DataFrame({'name': ['Alice', 'Bob', 'Charlie'], 'roll no': [12, 14, 16]})
pd.concat([var,var2], ignore_index=True)

      name   age  roll no
0     John  25.0      NaN
1    Alice  12.0      NaN
2      Bob  14.0      NaN
3    Alice   NaN     12.0
4      Bob   NaN     14.0
5  Charlie   NaN     16.0

In [9]:
#concat along rows
pd.concat([var,var2], axis=0)

      name   age  roll no
0     John  25.0      NaN
1    Alice  12.0      NaN
2      Bob  14.0      NaN
0    Alice   NaN     12.0
1      Bob   NaN     14.0
2  Charlie   NaN     16.0

In [10]:
pd.concat([var,var2],axis=1,keys=["d1","d2"])

      d1           d2
    name age     name roll no
0   John  25    Alice      12
1  Alice  12      Bob      14
2    Bob  14  Charlie      16